app/controllers/user_controller.rb

  def login
=begin
    if session[:user_id]
      redirect_to action: :home and return
    end
=end
    @title = "Welcome"
    if logged_in
      redirect_to "/tweet/tweet/home" and return
    else
      if params[:submit]
        @user = User.find_last_by_username(params[:username])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'subodh' ORDER BY `users`.`id` DESC LIMIT 1

  def sign_up
    @title = "Welcome"
    if logged_in
      redirect_to "/tweet/tweet/home" and return
    else
      if params[:back]
        redirect_to  action: :login and return
      end
      if params[:commit]
        if params[:password].to_s==params[:re_password]
          @user=User.new(:name => params[:name], :username => params[:username], :password => params[:password])
          @user.save
          if !@user.errors.blank?
---
INSERT INTO `users` (`created_at`, `name`, `password`, `updated_at`, `username`) VALUES ('2013-07-08 07:49:46', 'Jerrod Blick II', 'shubham', '2013-07-08 07:49:46', 'subodh')
SELECT 1 AS one FROM `users` WHERE `users`.`username` = BINARY 'subodh' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'subodh' LIMIT 1

  def profile
    if logged_in
      if params[:user] && is_integer?(params[:user]) && User.exists?(id: params[:user])
        @userpro = User.find(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 171 LIMIT 1

  def all_users
    if logged_in
      @user = User.find(session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 136 LIMIT 1